Repository: stephan1827/shuv_demo
Catalog: Logical/mappView/MainVisu/Pages/UseCasePage/UseCases.tmx
Source language: en
Languages: de

source: Unit binding from text id This use case describes how units can be managed in a text key and can be switched via an IndexText snippet. The Textkey selected via the DropDownBox is bound to a session variable, which in turn is bound to the unit Property of the NumericOutput widget.
de: Unit Binding aus TextID Dieser Anwendungsfall beschreibt, wie Einheiten in einem Textkey verwaltet und über ein IndexText Snippet umgeschalten werden können. Der über die DropDownBox selektierte Textkey wird auf eine Session Variable gebunden, welche wiederum an das unit Property des NumericOutput Widgets gebunden ist.

source: Menu with dialogs This use case describes how a menu can be implemented using absolutely positioned dialogs. The dialogs are opened and closed only via the EventBinding.
de: Menü mit Dialogen Dieser use case beschreibt, wie ein Menü mit Hilfe von absolut positionierten Dialoge realisiert werden kann. Das Öffnen und Schließen der Dialoge erfolgt nur über das EventBinding.

source: Large Content A content is referenced to an area that is larger than this area. Scroll bars allow you to move the content in the area.
de: Großer Content Es wird ein Content auf eine Area referenziert, welcher größer als diese ist. Scrollbalken erlauben das verschieben des Contents in der Area.

source: Determine time difference between two measuring cursors Two measuring cursors can be moved along the time axis. The time for each cursor position is determined and the time difference between the cursors is determined using expressions.
de: Zeitdifferenz zwischen zwei Messcursor ermitteln Es können zwei Messcursor an der Zeitachse bewegt werden. Es wird die Zeit für jede Cursorposition und die Zeitdifferenz zwischen den Cursor mit Hilfe von Expressions ermittelt.

source: Determine time index between two measuring cursors Two measuring cursors can be moved along the index axis. The index difference between the cursors is determined using expressions.
de: Indexdifferenz zwischen zwei Messcursor ermitteln Es können zwei Messcursor an der Indexachse bewegt werden. Es wird die Indexdifferenz zwischen den Cursor mit Hilfe von Expressions ermittelt.

source: 2 step confirmation An input is made to a session variable. In the first step (Accept), the value is passed to another session variable. In step two (Confirm), this value is written to the OPC UA variable.
de: 2 Schritt Bestätigung Eine Eingabe wird auf eine Session Variable durchgeführt. Im ersten Schritt (Accept) wird diese in eine weitere Session Variable übergeben. Erst im zweiten Schritt (Confirm) wird dieser Wert auf die OPC UA Variable geschrieben.

source: Widget use cases Pressing the HoverButton displays additional HoverButton widgets. While pressing, these can be selected by a drag operation, whereby any action is executed.
de: Widget Anwendungen Beim Drücken des HoverButtons werden weitere HoverButton Widgets angezeigt. Während des Drückens können diese durch eine Drag Operation ausgewählt werden, wodurch eine beliebige Aktion ausgeführt wird.

source: Temperatures
de: Temperatur

source: Pressure
de: Druck

source: Length
de: Länge

source: Select unit
de: Einheit wählen

source: Set value
de: Sollwert

source: Value with selected unit
de: Wert in ausgewählter Einheit

source: Centimeter
de: Zentimeter

source: Decimeter
de: Dezimeter

source: Input
de: Eingabe

source: Accept value
de: Wert bestätigen

source: Confirm value
de: Wert übernehmen

source: Dynamic units
de: Dynamische Einheiten

source: Menu with dialogs
de: Menü mit Dialogen

source: Large Content
de: Großer Content

source: Cursor time diff.
de: Cursor Zeit Diff.

source: 2 step confirmation
de: 2 Schritt Bestätigung

source: Logarithmic chart
de: Logarithmischer Chart

source: Widget use cases
de: Widget Anwendungen

source: Formular Input
de: Formular Eingabe

source: Widget overview
de: Widget Übersicht
